# TotalCoefficient Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..TotalCoefficient Property
MEPSection Class See Also
---
The loss coefficient of the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TotalCoefficient { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalCoefficient As Double
	Get
```

Visual C++
---
```text
public:
property double TotalCoefficient {
	double get ();
}
```

# Remarks
It's total of all fittings and segments. Coefficient is a number. The unit type is UT_Number.
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace